<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_app_url</key>
		<string>https://cursor.com/</string>
		<key>pfm_description</key>
		<string>Cursor Managed Settings</string>
		<key>pfm_documentation_url</key>
		<string>https://docs.cursor.com/en/account/teams/enterprise-settings</string>
		<key>pfm_domain</key>
		<string>com.todesktop.230313mzl4w4u92</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_interaction</key>
		<string>combined</string>
		<key>pfm_last_modified</key>
		<date>2025-10-17T01:52:09Z</date>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_subkeys</key>
		<array>
			<dict>
				<key>pfm_default</key>
				<string>Configure Cursor</string>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>Cursor</string>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>com.todesktop.230313mzl4w4u92</string>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>com.todesktop.230313mzl4w4u92</string>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string />
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_range_list</key>
				<array>
					<integer>1</integer>
				</array>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>Anysphere</string>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string />
				<key>pfm_description</key>
				<string>Specify the required team id that a user must belong to in order to use
					Cursor. If set and the signed-in user is not part of the team, Cursor will
					automatically sign the user out.</string>
				<key>pfm_name</key>
				<string>AllowedTeamId</string>
				<key>pfm_title</key>
				<string>Allowed Team ID</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>Controls whether or not Workspace Trust is enabled within VS Code.</string>
				<key>pfm_name</key>
				<string>WorkspaceTrustEnabled</string>
				<key>pfm_title</key>
				<string>Workspace Trust Enabled</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string />
				<key>pfm_description</key>
				<string>Configure the Marketplace service URL to connect to</string>
				<key>pfm_name</key>
				<string>ExtensionGalleryServiceUrl</string>
				<key>pfm_title</key>
				<string>Extension Gallery Service URL</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string />
				<key>pfm_description</key>
				<string>
					Specify a list of extensions that are allowed to use. This helps maintain a
					secure and consistent development environment by restricting the use of
					unauthorized extensions. More information:
					https://code.visualstudio.com/docs/setup/enterprise#_configure-allowed-extensions</string>
				<key>pfm_name</key>
				<string>AllowedExtensions</string>
				<key>pfm_title</key>
				<string>Allowed Extensions</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>Disable HTTP/2 for all requests, and use HTTP/1.1 instead. This increases
					resource utilization and latency, but is useful behind a corporate proxy that
					blocks HTTP/2.</string>
				<key>pfm_name</key>
				<string>NetworkDisableHttp2</string>
				<key>pfm_title</key>
				<string>Network Disable HTTP2</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>none</string>
				<key>pfm_description</key>
				<string>Configure whether you receive automatic updates. Requires a restart after
					change. The updates are fetched from a Microsoft online service.</string>
				<key>pfm_name</key>
				<string>UpdateMode</string>
				<key>pfm_title</key>
				<string>Update Mode</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_range_list</key>
				<array>
					<string>none</string>
					<string>manual</string>
					<string>start</string>
					<string>default</string>
				</array>
			</dict>
		</array>
		<key>pfm_title</key>
		<string>Cursor</string>
		<key>pfm_unique</key>
		<true />
		<key>pfm_version</key>
		<integer>1</integer>
	</dict>
</plist>